# coding:utf-8
import difflib


def test1(string):
    # string = "基于信道质量切换开关:关&同频条件切换开关:关&同频协同切换优化开关:关"
    splits = string.split("&")
    result = []
    for s in splits:
        col = s.split(":")[0]
        result.append(col)
    print(result)


def compare_strings(str1, str2):
    d = difflib.Differ()
    return list(d.compare(list(str1), list(str2)))


def test2(string):
    splits = string.split("  ")
    splits = list(filter(lambda x: x.strip() != "", splits))

    print(splits)
    print(len(splits))


if __name__ == "__main__":
    str1 = "LST NRCELLHOEUTRANMEAGRPINTERRHOTOEUTRANMEASGRPID=0"
    str2 = "LST NRCELLHOEUTRANMEAGRP:INTERRHOTOEUTRANMEASGRPID=0;"
    # test1("E-UTRAN切换开关:开&E-UTRAN重定向开关:开&语音业务盲模式开关:开&基于覆盖的E-UTRAN最强邻区重定向开关:关&VoNR基于覆盖的切换优先开关:关&重建流程中EPS Fallback变更开关:关")
    test2('本地小区标识  下行频点  上行频点配置指示  上行频点  异频频点小区重选优先级配置指示  异频频点小区重选优先级  EUTRAN异频重选时间(秒)  速度相关重选参数配置指示  中速移动状态UE的EUTRAN小区重选时间比例因子  高速移动状态UE的EUTRAN小区重选时间比例因子  测量带宽  频率偏置(dB)  异频频点高优先级重选门限(2dB)  异频频点低优先级重选门限(2dB)  最低接收电平(2dBm)  最大发射功率指示  最大发射功率(dBm)  异频邻区配置信息  本地小区异频邻区双发射天线配置指示  异频切换触发事件类型  异频频点RSRQ高优先级重选门限(dB)  异频频点RSRQ低优先级重选门限(dB)  最小接收信号质量配置指示  最小接收信号质量(dB)  连接态频率优先级  负载均衡目标频点标识  基于频率优先级的切换测量标志位  Idle态MLB释放比例(%)  负载平衡频点优先级  下行频率偏移  上行频率偏移  连接态频率偏置(dB)  测量频率优先级  基于覆盖的异频切换RSRP门限偏置(dB)  异频负载均衡RSRP门限偏置(dB)  主频段指示  异频相邻频点RAN共享指示  异频频点高速指示  ANR指示  Voip优先级  数据业务优先级  VoLTE切换目标频点指示  低效用户负载平衡目标频点标识  MLB异频切换触发事件类型  移动性目标频点指示                                                                                                                                                                                                  MLB异频频谱效率比例  基于SNR的用户选择模式  上行业务负载平衡目标频点标识  上行业务切换优先级  MLB异频A3偏置(0.5dB)  基于业务的异频切换RSRP门限偏置(dB)  基于业务的异频切换RSRQ门限偏置(0.5dB)  负载平衡频点上行优先级  异频负载平衡下行PRB偏置(%)  异频负载平衡上行PRB偏置(%)  ANR的邻区个数  测量性能要求  异频低效负载均衡RSRP门限偏置(dB)  异频低效负载均衡RSRQ门限偏置(0.5dB)  语音质量的异频切换目标频点指示  Idle态eMTC UE MLB释放比例(%)  异频CIO调整范围配置指示  异频CIO调整范围最小值(dB)  异频CIO调整范围最大值(dB)  异频4T频点标识  频率优先级切换的测量优先级  eMTC异频频点小区重选优先级  NB-IoT UE异频小区重选功率偏置值(dB)  异频切换A5门限1 RSRP偏置(dB)  异频切换A5门限1 RSRQ偏置(0.5dB)  异频周期测量报告频点组标识  异频重定向控制开关  NB-IoT UE异频重定向功率偏置值(dB)  CE Mode A模式最低接入信号质量(dB)  CE Mode B模式最低接入信号质量(dB)  CE Mode A模式最低接收电平(2dBm)  CE Mode B模式最低接收电平(2dBm)  基于覆盖的VoLTE异频切换A5门限1 RSRP偏置(dB)  基于覆盖的VoLTE异频切换A5门限2 RSRP偏置(dB)  基于A3的异频切换的服务小区RSRP偏置(dB)  基于覆盖的异频切换NSA DC用户服务小区RSRP偏置(dB)  聚合属性                                                                                                                           基于频率优先级的切换A4门限RSRP偏置(dB)')
    # res =compare_strings("LST NRCELLHOEUTRANMEAGRPINTERRHOTOEUTRANMEASGRPID=0", "LST NRCELLHOEUTRANMEAGRPINTERRHOTOEUTRANMEASGRPID=1")
    #  # dff1 = [diff_str for diff_str in str1 if diff_str not in str2]
    #  # print(dff1)
    # str = 'WZ2809_3920', 'WZ2805_3916', 'WZ2803_3918', 'WZ2808_3920', 'WZ2802_3921', 'WZ2811_3916', 'WZ2801_3918', 'WZ2803_3921', 'WZ2808_3916', 'WZ2809_3929', 'WZ2807_3919', 'WZ2804_3919', 'WZ2804_3926', 'WZ2802_3923', 'WZ2801_3926', 'WZ2809_3921', 'WZ2800_3922', 'WZ2805_3925', 'WZ2804_3915', 'WZ2802_3927', 'WZ2809_3928', 'WZ2803_3916', 'WZ2803_3926', 'WZ2806_3926', 'WZ2807_3925', 'WZ2809_3918', 'WZ2804_3924', 'WZ2806_3918', 'WZ2805_3926', 'WZ2806_3927', 'WZ2800_3925', 'WZ2808_3918', 'WZ2804_3929', 'WZ2804_3925', 'WZ2809_3927', 'WZ2807_3926', 'WZ2811_3917', 'WZ2814_3919', 'WZ2810_3920', 'WZ2807_3920', 'WZ2806_3928', 'WZ2807_3916', 'WZ2803_3928', 'WZ2812_3916', 'WZ2814_3918', 'WZ2805_3922', 'WZ2804_3920', 'WZ2806_3915', 'WZ2804_3917', 'WZ2812_3920', 'WZ2800_3923', 'WZ2805_3920', 'WZ2803_3919', 'WZ2801_3919', 'WZ2801_3925', 'WZ2805_3918', 'WZ2803_3925', 'WZ2802_3926', 'WZ2806_3919', 'WZ2807_3923', 'WZ2806_3920', 'WZ2809_3917', 'WZ2811_3919', 'WZ2802_3924', 'WZ2800_3921', 'WZ2802_3918', 'WZ2802_3917', 'WZ2807_3917', 'WZ2808_3925', 'WZ2805_3927', 'WZ2803_3920', 'WZ2810_3915', 'WZ2812_3917', 'WZ2804_3928', 'WZ2811_3920', 'WZ2810_3919', 'WZ2803_3917', 'WZ2809_3915', 'WZ2804_3918', 'WZ2808_3928', 'WZ2805_3929', 'WZ2812_3919', 'WZ2806_3916', 'WZ2805_3921', 'WZ2805_3917', 'WZ2806_3921', 'WZ2802_3925', 'WZ2811_3918', 'WZ2802_3920', 'WZ2812_3918', 'WZ2807_3928', 'WZ2801_3924', 'WZ2805_3915', 'WZ2802_3919', 'WZ2810_3918', 'WZ2806_3924', 'WZ2810_3917', 'WZ2808_3919', 'WZ2808_3926', 'WZ2804_3921', 'WZ2810_3916', 'WZ2807_3918', 'WZ2808_3921', 'WZ2802_3922', 'WZ2803_3924', 'WZ2807_3915', 'WZ2804_3927', 'WZ2806_3929', 'WZ2808_3929', 'WZ2809_3919', 'WZ2800_3924', 'WZ2807_3927', 'WZ2800_3920', 'WZ2805_3923', 'WZ2807_3922', 'WZ2808_3927', 'WZ2813_3917', 'WZ2807_3924', 'WZ2805_3919', 'WZ2801_3923', 'WZ2801_3922', 'WZ2806_3917', 'WZ2806_3923', 'WZ2803_3927', 'WZ2813_3919', 'WZ2801_3921', 'WZ2806_3925', 'WZ2808_3915', 'WZ2807_3921', 'WZ2801_3920', 'WZ2806_3922', 'WZ2803_3922', 'WZ2804_3923', 'WZ2800_3919', 'WZ2804_3922', 'WZ2803_3923', 'WZ2804_3916', 'WZ2807_3929', 'WZ2808_3917', 'WZ2805_3924', 'WZ2805_3928', 'WZ2809_3916', 'WZ2813_3918'
    # print(len(str.split(",")))
